Revit 2027 API
ElectricalEquipment.DistributionSystem Property
 get or set the Distribution System for the Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DistributionSysType DistributionSystem { get; set; }
Public Property DistributionSystem As DistributionSysType
	Get
	Set
public:
property DistributionSysType^ DistributionSystem {
	DistributionSysType^ get ();
	void set (DistributionSysType^ value);
}
member DistributionSystem : DistributionSysType with get, set
Property Value
DistributionSysType
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The Distribution System can not be assigned to the Electrical Equipment.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This property returns a Distribution System which is assigned to the Electrical Equipment. If there are no Distribution System assigned to this Electrical Equipment, this property will be null.
See Also
Reference
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace